In [33]:
import numpy as np
import pandas as pd

## concat

In [34]:
liste1={"İsim":["Ali","Murat","Şems"],"Spor":["Koşu","Yüzme","Futbol"],"Kalori":[100,50,0]}

In [35]:
liste2={"İsim":["Ahmet","Mehmet","Muhammet","Hasan"],"Spor":["Koşu","Yüzme","Basketbol","Koşu"],"Kalori":[200,500,600,600]}

In [36]:
liste3={"İsim":["Hüseyin","Habip","Con","Fazıl"],"Spor":["At Biniciliği","Koşu","Koşu","At Biniciiğ,"],"Kalori":[1000,500,600,1000]}

In [37]:
dataFrame1=pd.DataFrame(liste1,index=[0,1,2])

In [38]:
dataFrame2=pd.DataFrame(liste2,index=[3,4,5,6])

In [39]:
dataFrame3=pd.DataFrame(liste3,index=[7,8,9,10])

In [40]:
dataFrame1

    İsim    Spor  Kalori
0    Ali    Koşu     100
1  Murat   Yüzme      50
2   Şems  Futbol       0

In [41]:
dataFrame2

       İsim       Spor  Kalori
3     Ahmet       Koşu     200
4    Mehmet      Yüzme     500
5  Muhammet  Basketbol     600
6     Hasan       Koşu     600

In [42]:
dataFrame3

       İsim           Spor  Kalori
7   Hüseyin  At Biniciliği    1000
8     Habip           Koşu     500
9       Con           Koşu     600
10    Fazıl   At Biniciiğ,    1000

In [43]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

        İsim           Spor  Kalori
0        Ali           Koşu     100
1      Murat          Yüzme      50
2       Şems         Futbol       0
3      Ahmet           Koşu     200
4     Mehmet          Yüzme     500
5   Muhammet      Basketbol     600
6      Hasan           Koşu     600
7    Hüseyin  At Biniciliği    1000
8      Habip           Koşu     500
9        Con           Koşu     600
10     Fazıl   At Biniciiğ,    1000

## merge

In [44]:
mergeSozluk1={"İsim":["Hüseyin","Fazıl","Asker","Ekber"],"Spor":["At Biniciliği","Koşu","Koşu","Tenis"]}

In [45]:
mergeSozluk2={"İsim":["Hüseyin","Fazıl","Asker","Ekber"],"Kalori":[1400,1200,1000,500]}

In [46]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [47]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [48]:
mergeDataFrame1

      İsim           Spor
0  Hüseyin  At Biniciliği
1    Fazıl           Koşu
2    Asker           Koşu
3    Ekber          Tenis

In [49]:
mergeDataFrame2

      İsim  Kalori
0  Hüseyin    1400
1    Fazıl    1200
2    Asker    1000
3    Ekber     500

In [50]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="İsim")

      İsim           Spor  Kalori
0  Hüseyin  At Biniciliği    1400
1    Fazıl           Koşu    1200
2    Asker           Koşu    1000
3    Ekber          Tenis     500

In [51]:
dataMaas={"İsim":["Ali","Hüseyin","Zeyneb","Fazıl"],"Departman":["Yazılım","Satış","Pazarlama","Yazılım"],"Maas":[500,300,400,450]}

In [52]:
maasDataFrame=pd.DataFrame(dataMaas)

In [53]:
maasDataFrame

      İsim  Departman  Maas
0      Ali    Yazılım   500
1  Hüseyin      Satış   300
2   Zeyneb  Pazarlama   400
3    Fazıl    Yazılım   450

In [54]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [55]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [56]:
maasDataFrame["Departman"].nunique()

3

In [57]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [58]:
def buruttenNet(maas):
    return maas*0.66

In [59]:
maasDataFrame["Maas"].apply(buruttenNet)

0    330.0
1    198.0
2    264.0
3    297.0
Name: Maas, dtype: float64

In [60]:
maasDataFrame.isnull()

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [61]:
yeniVeri={"Karakter Sınıfı":["Sout Park","Sout Park","Simpson","Simpson","Simpson"],
         "Karakter İsmi":["Cartman","Kenny","Homer","Bart","Bart"],
          "Karakter Yas":[9,10,50,20,10]
         }

In [62]:
yeniDataFrame=pd.DataFrame(yeniVeri)

In [63]:
yeniDataFrame

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0       Sout Park       Cartman             9
1       Sout Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [64]:
yeniDataFrame.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter İsmi"],aggfunc=np.sum)   #####bart iki tane olduğundan ortalamasını verdi ama "aggfunc=np.sum" ekliyince toplamını verdi

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     30
                Homer                    50
Sout Park       Cartman                   9
                Kenny                    10